In [2]:
import pandas as pd

In [4]:
df = pd.read_csv("./datas/ml-latest-small/ratings.csv")

In [5]:
df.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [6]:
df.count()

userId       100836
movieId      100836
rating       100836
timestamp    100836
dtype: int64

## 1.使用index查询数据

In [7]:
# drop=False,让索引列害保持在column

In [8]:
df.set_index("userId",inplace=True,drop=False)

In [9]:
df.head()

        userId  movieId  rating  timestamp
userId
1            1        1     4.0  964982703
1            1        3     4.0  964981247
1            1        6     4.0  964982224
1            1       47     5.0  964983815
1            1       50     5.0  964982931

In [10]:
df.index

Int64Index([  1,   1,   1,   1,   1,   1,   1,   1,   1,   1,
            ...
            610, 610, 610, 610, 610, 610, 610, 610, 610, 610],
           dtype='int64', name='userId', length=100836)

In [12]:
# 使用index的查询方法
df.loc[500].head(5)

        userId  movieId  rating   timestamp
userId
500        500        1     4.0  1005527755
500        500       11     1.0  1005528017
500        500       39     1.0  1005527926
500        500      101     1.0  1005527980
500        500      104     4.0  1005528065

In [14]:
# 使用column的condition查询方法
df.loc[df["userId"] == 500].head()

        userId  movieId  rating   timestamp
userId
500        500        1     4.0  1005527755
500        500       11     1.0  1005528017
500        500       39     1.0  1005527926
500        500      101     1.0  1005527980
500        500      104     4.0  1005528065

## 2.使用index会提升查询性能

## 3.使用index能自动对齐数据
#### 包括Series和DataFrame

In [15]:
s1 = pd.Series([1,2,3],index=list("abc"))

In [16]:
s1

a    1
b    2
c    3
dtype: int64

In [17]:
s2 = pd.Series([2,3,4],index=list("bcd"))

In [18]:
s2

b    2
c    3
d    4
dtype: int64

In [19]:
s1 + s2

a    NaN
b    4.0
c    6.0
d    NaN
dtype: float64